nito-008/gooddisplay-epaper-esp32/examples/gxepd2/main.cpp
// note for partial update window and setPartialWindow() method:
// partial update window size and position is on byte boundary in physical x direction
// the size is increased in setPartialWindow() if x or w are not multiple of 8 for even rotation, y or h for odd rotation
// see also comment in GxEPD2_BW.h, GxEPD2_3C.h or GxEPD2_GFX.h for method setPartialWindow()
// showPartialUpdate() purposely uses values that are not multiples of 8 to test this

void showPartialUpdate()
{
  // some useful background
  helloWorld();
  // use asymmetric values for test
  uint16_t box_x = 10;
  uint16_t box_y = 15;
  uint16_t box_w = 70;
  uint16_t box_h = 20;
  uint16_t cursor_y = box_y + box_h - 6;
  if (display.epd2.WIDTH < 104)
    cursor_y = box_y + 6;
  float value = 13.95;
  uint16_t incr = display.epd2.hasFastPartialUpdate ? 1 : 3;
  display.setFont(&FreeMonoBold9pt7b);
  if (display.epd2.WIDTH < 104)
    display.setFont(0);
  display.setTextColor(GxEPD_BLACK);
  // show where the update box is
  for (uint16_t r = 0; r < 4; r++)
  {
    display.setRotation(r);
    display.setPartialWindow(box_x, box_y, box_w, box_h);
    display.firstPage();
    do
    {
      display.fillRect(box_x, box_y, box_w, box_h, GxEPD_BLACK);
      // display.fillScreen(GxEPD_BLACK);
    } while (display.nextPage());
    delay(2000);
    display.firstPage();
    do
    {
      display.fillRect(box_x, box_y, box_w, box_h, GxEPD_WHITE);
    } while (display.nextPage());
    delay(1000);
  }
  // return;
  //  show updates in the update box
  for (uint16_t r = 0; r < 4; r++)
  {
    display.setRotation(r);
    display.setPartialWindow(box_x, box_y, box_w, box_h);
    for (uint16_t i = 1; i <= 10; i += incr)
    {
      display.firstPage();
      do
      {
        display.fillRect(box_x, box_y, box_w, box_h, GxEPD_WHITE);
        display.setCursor(box_x, cursor_y);
        display.print(value * i, 2);
      } while (display.nextPage());
      delay(500);
    }
    delay(1000);
    display.firstPage();
    do
    {
      display.fillRect(box_x, box_y, box_w, box_h, GxEPD_WHITE);
    } while (display.nextPage());
    delay(1000);
  }
}

void drawGrid()
{
  int16_t x, y;
  display.firstPage();
  do
  {
    x = 0;
    do
    {
      display.drawLine(x, 0, x, display.height() - 1, GxEPD_BLACK);
      x += 10;
    } while (x < display.width());
    y = 0;
    do
    {
      display.drawLine(0, y, display.width() - 1, y, GxEPD_BLACK);
      y += 10;
    } while (y < display.height());
    x = 0;
    do
    {
      display.fillCircle(x, display.height() / 2, 3, GxEPD_BLACK);
      x += 50;
    } while (x <= display.width());
    y = 0;
    do
    {
      display.fillCircle(display.width() / 2, y, 3, GxEPD_BLACK);
      y += 50;
    } while (y <= display.height());
  } while (display.nextPage());
}

#ifdef _GxBitmaps800x480_H_
void drawBitmaps800x480()
{
#if defined(ARDUINO_UNOR4_MINIMA) || defined(ARDUINO_UNOR4_WIFI)
  const unsigned char *bitmaps[] =
      {
          Bitmap800x480_3, Bitmap800x480_4};
#elif !defined(__AVR)
  const unsigned char *bitmaps[] =
      {
          Bitmap800x480_1, Bitmap800x480_2, Bitmap800x480_3, Bitmap800x480_4};
#else
  const unsigned char *bitmaps[] = {}; // not enough code space
#endif
  if ((display.epd2.WIDTH == 800) && (display.epd2.HEIGHT == 480) && !display.epd2.hasColor)
  {
    for (uint16_t i = 0; i < sizeof(bitmaps) / sizeof(char *); i++)
    {
      display.firstPage();
      do
      {
        display.fillScreen(GxEPD_WHITE);
        display.drawBitmap(0, 0, bitmaps[i], 800, 480, GxEPD_BLACK);
      } while (display.nextPage());
      delay(2000);
    }
#if defined(ESP32)
    if (display.epd2.panel == GxEPD2::GDEM0397T81)
    {
      display.drawImage(Bitmap800x480_5, 0, 0, 800, 480, false, true, true);
      delay(2000);
      display.drawImage(Bitmap800x480_6, 0, 0, 800, 480, false, true, true);
      delay(2000);
      display.drawImage(Bitmap800x480_7, 0, 0, 800, 480, false, true, true);
      delay(2000);
      display.drawImage(Bitmap800x480_8, 0, 0, 800, 480, false, true, true);
      delay(2000);
      display.drawImage(Bitmap800x480_9, 0, 0, 800, 480, false, true, true);
      delay(2000);
    }
#endif
    if ((display.epd2.panel == GxEPD2::GDEW075T7) || (display.epd2.panel == GxEPD2::GDEY075T7))
    {
      // avoid ghosting caused by OTP waveform
      display.clearScreen();
      display.refresh(false); // full update
    }
  }
}
#endif

#ifdef _GxBitmaps3c800x480_H_
void drawBitmaps3c800x480()
{
#if !defined(__AVR)
  bitmap_pair bitmap_pairs[] =
      {
          {Bitmap3c800x480_1_black, Bitmap3c800x480_1_red}};
#else
  bitmap_pair bitmap_pairs[] = {}; // not enough code space
#endif
  if (display.epd2.panel == GxEPD2::GDEW075Z08)
  {
    for (uint16_t i = 0; i < sizeof(bitmap_pairs) / sizeof(bitmap_pair); i++)
    {
      display.firstPage();
      do
      {
        display.fillScreen(GxEPD_WHITE);
        display.drawBitmap(0, 0, bitmap_pairs[i].black, display.epd2.WIDTH, display.epd2.HEIGHT, GxEPD_BLACK);
        display.drawBitmap(0, 0, bitmap_pairs[i].red, display.epd2.WIDTH, display.epd2.HEIGHT, GxEPD_RED);
      } while (display.nextPage());
      delay(2000);
    }
  }
}
#endif

void drawBitmaps()
{
  display.setRotation(0);
  display.setFullWindow();
#ifdef _GxBitmaps800x480_H_
  drawBitmaps800x480();
#endif
#ifdef _GxBitmaps3c800x480_H_
  drawBitmaps3c800x480();
#endif
}

void drawGraphics()
{
  display.setRotation(0);
  display.firstPage();
  do
  {
    display.drawRect(display.width() / 8, display.height() / 8, display.width() * 3 / 4, display.height() * 3 / 4, GxEPD_BLACK);
    display.drawLine(display.width() / 8, display.height() / 8, display.width() * 7 / 8, display.height() * 7 / 8, GxEPD_BLACK);
    display.drawLine(display.width() / 8, display.height() * 7 / 8, display.width() * 7 / 8, display.height() / 8, GxEPD_BLACK);
    display.drawCircle(display.width() / 2, display.height() / 2, display.height() / 4, GxEPD_BLACK);
    display.drawPixel(display.width() / 4, display.height() / 2, GxEPD_BLACK);
    display.drawPixel(display.width() * 3 / 4, display.height() / 2, GxEPD_BLACK);
  } while (display.nextPage());
  delay(1000);
}

void setup()
{
  Serial.begin(115200);
  Serial.println();
  Serial.println("setup");
  delay(100);
  // display.init(115200); // default 10ms reset pulse, e.g. for bare panels with DESPI-C02
  display.init(115200, true, 50, false);
  // display.init(115200, true, 2, false); // USE THIS for Waveshare boards with "clever" reset circuit, 2ms reset pulse
  //   display.init(115200, true, 10, false, SPIn, SPISettings(4000000, MSBFIRST, SPI_MODE0)); // extended init method with SPI channel and/or settings selection
  if (display.pages() > 1)
  {
    delay(100);
    Serial.print("pages = ");
    Serial.print(display.pages());
    Serial.print(" page height = ");
    Serial.println(display.pageHeight());
    delay(1000);
  }
  Serial.print("clearing...\n");
  display.clearScreen();
  Serial.print("cleared\n");
  //  first update should be full refresh
  // helloWorld();
  // delay(1000);
  // partial refresh mode can be used to full screen,
  // effective if display panel hasFastPartialUpdate
  // helloFullScreenPartialMode();
  // delay(1000);
  // stripeTest(); return; // GDEH029Z13 issue
  // helloArduino();
  // delay(1000);
  // helloEpaper();
  // delay(1000);
  // helloValue(123.9, 1);
  // delay(1000);
  // showFont("FreeMonoBold9pt7b", &FreeMonoBold9pt7b);
  // showFont("FreeMonoBold12pt7b", &FreeMonoBold12pt7b);
  // delay(1000);
  // if (display.epd2.WIDTH < 104)
  // {
  //   showFont("glcdfont", 0);
  //   delay(1000);
  // }
  // drawGrid(); return;
  // drawCornerTest(); return;
  // display.writeScreenBuffer();
  // drawBitmaps();
  // display.powerOff(); return;
  // drawGraphics();
  // display.powerOff(); return;

   if (display.epd2.hasPartialUpdate)
  {
     showPartialUpdate();
     delay(1000);
   } // else // on GDEW0154Z04 only full update available, doesn't look nice

  display.firstPage();
  do
  {
    display.fillScreen(GxEPD_WHITE);
    display.drawBitmap(0, 0, Bitmap_Human, 800, 480, GxEPD_BLACK);
  } while (display.nextPage());

  // drawCornerTest();
  // showBox(16, 16, 48, 32, false);
  // showBox(16, 56, 48, 32, true);
  display.powerOff();
  // deepSleepTest();
  Serial.println("setup done");
  display.end();
}

void loop()
{
}